package ua.starovoitov.hw10;

/**
 *1) Создать класс car (будет служить родительским)
 *    - с полями: серия, год, цвет, топливо
 *    - с методами: I) движение (движется пока есть топливо),
 *                  II) метод показать статистику
 *    - добавить конструктор на 4 поля
 * 2) Создать дочерний класс passenger car
 *    - добавить поле класс passenger
 *    - добавить метод посадить пассажира (в машине не может быть более 3 пассажиров)
 * 3) Создать дочерний класс truck
 *    - добавить поле cargo
 *    - добавить метод погрузки и выгрузки груза
 *    - переопределить метод движения (потребления топлива х2 от нормы)
 * 4) Создать интерфейс Recovery с методом refuel (восстанавливает топливо машины до полного значения)
 * 5) Имплементировать интерфейс в созданных ранее типах машин
 */
public class Task1 {
}
